In [34]:
# Dependencies
import pandas as pd
import numpy as np

In [35]:
# Load and read in AtheleteEvents
data_load1 = "../csv_data/athlete_events.csv"
athelte_data = pd.read_csv(data_load1)
athelte_data.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [36]:
# Select desired columns
medal_data = pd.DataFrame(athelte_data, columns=['Sex', 'Team', 'NOC', 'Games', 'Year', 'Season', 'City', 'Sport', 'Medal'])
medal_data.head()

,Sex,Team,NOC,Games,Year,Season,City,Sport,Medal
0,M,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,NaN
1,M,China,CHN,2012 Summer,2012,Summer,London,Judo,NaN
2,M,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,NaN
3,M,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Gold
4,F,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,NaN

In [37]:
# Drop NA medals
medal_data = medal_data.dropna(subset= ['Medal'])
medal_data.head()

,Sex,Team,NOC,Games,Year,Season,City,Sport,Medal
3,M,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Gold
37,M,Finland,FIN,1920 Summer,1920,Summer,Antwerpen,Swimming,Bronze
38,M,Finland,FIN,1920 Summer,1920,Summer,Antwerpen,Swimming,Bronze
40,M,Finland,FIN,2014 Winter,2014,Winter,Sochi,Ice Hockey,Bronze
41,M,Finland,FIN,1948 Summer,1948,Summer,London,Gymnastics,Bronze

In [38]:
# Select desired Years
medal_data = medal_data.loc[medal_data['Year'] < 2013]

medal_data.head()

,Sex,Team,NOC,Games,Year,Season,City,Sport,Medal
3,M,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Gold
37,M,Finland,FIN,1920 Summer,1920,Summer,Antwerpen,Swimming,Bronze
38,M,Finland,FIN,1920 Summer,1920,Summer,Antwerpen,Swimming,Bronze
41,M,Finland,FIN,1948 Summer,1948,Summer,London,Gymnastics,Bronze
42,M,Finland,FIN,1948 Summer,1948,Summer,London,Gymnastics,Gold

In [39]:
# Bronze medals
bronze_df = medal_data.loc[medal_data["Medal"] == "Bronze"]
country_b = bronze_df.groupby("NOC")
country_b = country_b['Medal'].count()
bronze_medals = pd.DataFrame(country_b)
bronze_medals = bronze_medals.rename(columns={'Medal': 'Bronze'})
bronze_medals.head()

     Bronze
NOC
AFG       2
ALG       8
ANZ       5
ARG      91
ARM       9

In [40]:
# Silver medals
silver_df = medal_data.loc[medal_data["Medal"] == "Silver"]
country_s = silver_df.groupby("NOC")
country_s = country_s['Medal'].count()
silver_medals = pd.DataFrame(country_s)
silver_medals = silver_medals.rename(columns={'Medal': 'Silver'})
silver_medals.head()

     Silver
NOC
AHO       1
ALG       2
ANZ       4
ARG      91
ARM       2

In [41]:
# Gold medals
gold_df = medal_data.loc[medal_data["Medal"] == "Gold"]
country_g = gold_df.groupby("NOC")
country_g = country_g['Medal'].count()
gold_medals = pd.DataFrame(country_g)
gold_medals = gold_medals.rename(columns={'Medal': 'Gold'})
gold_medals.head()

     Gold
NOC
ALG     5
ANZ    20
ARG    70
ARM     1
AUS   325

In [42]:
bronze_silver_merge = bronze_medals.join(silver_medals)
country_medal_data = bronze_silver_merge.join(gold_medals)
country_medal_data = country_medal_data.fillna(0)
country_medal_data = country_medal_data.astype(int)
country_medal_data.head()

     Bronze  Silver  Gold
NOC
AFG       2       0     0
ALG       8       2     5
ANZ       5       4    20
ARG      91      91    70
ARM       9       2     1

In [43]:
# Save to CSV
# country_medal_data.to_csv('../csv_data/country_medal_data.csv')

medal_data.to_csv('../csv_data/athlete_medal_data.csv')

In [44]:
# Load in Temps. of Country
data_load3 = "../csv_data/GlobalLandTemperaturesByCountry.csv"
country_temp_data = pd.read_csv(data_load3)
country_temp_data.head()

,dt,AverageTemperature,AverageTemperatureUncertainty,Country
0,1743-11-01,4.384,2.294,Aland Islands
1,1743-12-01,NaN,NaN,Aland Islands
2,1744-01-01,NaN,NaN,Aland Islands
3,1744-02-01,NaN,NaN,Aland Islands
4,1744-03-01,NaN,NaN,Aland Islands

In [45]:
# Select desired rows and drop na
country_temp = pd.DataFrame(country_temp_data, columns= ['dt', 'AverageTemperature', 'Country'])
country_temp = country_temp.dropna()
country_temp = country_temp.rename(columns={'dt': 'Year'})
country_temp.head()

         Year  AverageTemperature        Country
0  1743-11-01               4.384  Aland Islands
5  1744-04-01               1.530  Aland Islands
6  1744-05-01               6.702  Aland Islands
7  1744-06-01              11.609  Aland Islands
8  1744-07-01              15.342  Aland Islands

In [46]:
country_temp['Year'] = pd.DatetimeIndex(country_temp['Year']).year
country_temp.head()

   Year  AverageTemperature        Country
0  1743               4.384  Aland Islands
5  1744               1.530  Aland Islands
6  1744               6.702  Aland Islands
7  1744              11.609  Aland Islands
8  1744              15.342  Aland Islands

In [47]:
# Select desired Years
country_temp = country_temp.loc[country_temp['Year'] > 1895]
country_temp = country_temp.loc[country_temp['Year'] < 2013]

country_temp.head()

      Year  AverageTemperature        Country
1826  1896              -0.841  Aland Islands
1827  1896              -0.718  Aland Islands
1828  1896              -0.704  Aland Islands
1829  1896               1.632  Aland Islands
1830  1896               6.457  Aland Islands

In [48]:
country_temp = country_temp.groupby(['Country', 'Year'])
country_temp = country_temp['AverageTemperature'].mean()
country_temp_clean = pd.DataFrame(country_temp)
country_temp_clean

                  AverageTemperature
Country     Year
Afghanistan 1896           14.098750
            1897           13.549750
            1898           13.461583
            1899           14.395833
            1900           13.749333
...                              ...
Zimbabwe    2008           21.545583
            2009           21.377250
            2010           21.986250
            2011           21.602417
            2012           21.521333

[28193 rows x 1 columns]

In [49]:
# Save to CSV
country_temp_clean.to_csv('../csv_data/country_temperature_data.csv')

In [50]:
# Load in Temps. of City
data_load4 = "../csv_data/GlobalLandTemperaturesByMajorCity.csv"
city_temp_data = pd.read_csv(data_load4)
city_temp_data.head()

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
0,1849-01-01,26.704,1.435,Abidjan,Cote d'Ivoire,5.63N,3.23W
1,1849-02-01,27.434,1.362,Abidjan,Cote d'Ivoire,5.63N,3.23W
2,1849-03-01,28.101,1.612,Abidjan,Cote d'Ivoire,5.63N,3.23W
3,1849-04-01,26.140,1.387,Abidjan,Cote d'Ivoire,5.63N,3.23W
4,1849-05-01,25.427,1.200,Abidjan,Cote d'Ivoire,5.63N,3.23W

In [51]:
# Select desired rows and drop na
city_temp = pd.DataFrame(city_temp_data, columns= ['dt', 'AverageTemperature', 'City', 'Country', 'Latitude', 'Longitude'])
city_temp = city_temp.dropna()
city_temp = city_temp.rename(columns={'dt': 'Year'})
city_temp.head()

         Year  AverageTemperature     City        Country Latitude Longitude
0  1849-01-01              26.704  Abidjan  Cote d'Ivoire    5.63N     3.23W
1  1849-02-01              27.434  Abidjan  Cote d'Ivoire    5.63N     3.23W
2  1849-03-01              28.101  Abidjan  Cote d'Ivoire    5.63N     3.23W
3  1849-04-01              26.140  Abidjan  Cote d'Ivoire    5.63N     3.23W
4  1849-05-01              25.427  Abidjan  Cote d'Ivoire    5.63N     3.23W

In [52]:
# Change dt to Year
city_temp['Year'] = pd.DatetimeIndex(city_temp['Year']).year
city_temp.head()

   Year  AverageTemperature     City        Country Latitude Longitude
0  1849              26.704  Abidjan  Cote d'Ivoire    5.63N     3.23W
1  1849              27.434  Abidjan  Cote d'Ivoire    5.63N     3.23W
2  1849              28.101  Abidjan  Cote d'Ivoire    5.63N     3.23W
3  1849              26.140  Abidjan  Cote d'Ivoire    5.63N     3.23W
4  1849              25.427  Abidjan  Cote d'Ivoire    5.63N     3.23W

In [53]:
# Changing Latitude South and Longitude South to negative
city_temp['Lat'] = pd.np.where(city_temp.Latitude.str.contains("S"), "-" + city_temp['Latitude'], city_temp['Latitude'])
city_temp['Long'] = pd.np.where(city_temp.Longitude.str.contains("W"), "-" + city_temp['Longitude'], city_temp['Longitude'])

# Slicing of N and W from Latitude and Longitude and adding (-) to longitude
city_temp['Lat'] = city_temp['Lat'].str[:-1]
city_temp['Long'] = city_temp['Long'].str[:-1]

city_temp.head()

,Year,AverageTemperature,City,Country,Latitude,Longitude,Lat,Long
0,1849,26.704,Abidjan,Cote d'Ivoire,5.63N,3.23W,5.63,-3.23
1,1849,27.434,Abidjan,Cote d'Ivoire,5.63N,3.23W,5.63,-3.23
2,1849,28.101,Abidjan,Cote d'Ivoire,5.63N,3.23W,5.63,-3.23
3,1849,26.140,Abidjan,Cote d'Ivoire,5.63N,3.23W,5.63,-3.23
4,1849,25.427,Abidjan,Cote d'Ivoire,5.63N,3.23W,5.63,-3.23

In [54]:
# Drop Latitude and Longitude Columns
city_temp = city_temp.drop(columns=['Latitude', 'Longitude'])

# Rename Lat and Long Columns
city_temp = city_temp.rename(columns={'Lat': 'Latitude', 'Long':'Longitude'})

city_temp.head()

   Year  AverageTemperature     City        Country Latitude Longitude
0  1849              26.704  Abidjan  Cote d'Ivoire     5.63     -3.23
1  1849              27.434  Abidjan  Cote d'Ivoire     5.63     -3.23
2  1849              28.101  Abidjan  Cote d'Ivoire     5.63     -3.23
3  1849              26.140  Abidjan  Cote d'Ivoire     5.63     -3.23
4  1849              25.427  Abidjan  Cote d'Ivoire     5.63     -3.23

In [55]:
# Select desired Years
city_temp = city_temp.loc[city_temp['Year'] > 1895]
city_temp = city_temp.loc[city_temp['Year'] < 2013]

city_temp.head()

     Year  AverageTemperature     City        Country Latitude Longitude
564  1896              26.059  Abidjan  Cote d'Ivoire     5.63     -3.23
565  1896              27.611  Abidjan  Cote d'Ivoire     5.63     -3.23
566  1896              26.907  Abidjan  Cote d'Ivoire     5.63     -3.23
567  1896              26.635  Abidjan  Cote d'Ivoire     5.63     -3.23
568  1896              25.530  Abidjan  Cote d'Ivoire     5.63     -3.23

In [56]:
# Groupby City, Year, Latitude, Longitude
# Determine mean of Temp
city_temp = city_temp.groupby(['Country','City', 'Year', 'Latitude', 'Longitude'])
city_temp = city_temp['AverageTemperature'].mean()
city_temp = pd.DataFrame(city_temp)
city_temp.head()

                                           AverageTemperature
Country     City  Year Latitude Longitude
Afghanistan Kabul 1896 34.56    70.05               14.573750
                  1897 34.56    70.05               13.692833
                  1898 34.56    70.05               13.885833
                  1899 34.56    70.05               14.690000
                  1900 34.56    70.05               14.111417

In [57]:
# Save to CSV
city_temp.to_csv('../csv_data/city_temperature_data.csv')

In [58]:
# Load and read in noc regions
data_load5 = "../csv_data/noc_regions.csv"
noc_data = pd.read_csv(data_load5)
noc_data.head()

   NOC       region                 notes
0  AFG  Afghanistan                   NaN
1  AHO      Curacao  Netherlands Antilles
2  ALB      Albania                   NaN
3  ALG      Algeria                   NaN
4  AND      Andorra                   NaN

In [59]:
# Groupby to limit index

In [60]:
# Drop notes
noc_data = noc_data.drop(columns=['notes'])
noc_data.head()

   NOC       region
0  AFG  Afghanistan
1  AHO      Curacao
2  ALB      Albania
3  ALG      Algeria
4  AND      Andorra

In [61]:
# Save to CSV
noc_data.to_csv('../csv_data/noc_regions_data.csv')

In [62]:
# country medal data and adding region to the table
country_medal_data = pd.merge(left=country_medal_data, right=noc_data, left_on="NOC", right_on="NOC")
country_medal_data.head()

   NOC  Bronze  Silver  Gold       region
0  AFG       2       0     0  Afghanistan
1  ALG       8       2     5      Algeria
2  ANZ       5       4    20    Australia
3  ARG      91      91    70    Argentina
4  ARM       9       2     1      Armenia

In [63]:
# Reorder columns
column_names = ['region', 'NOC', 'Bronze', 'Silver', 'Gold']
country_medal_data = country_medal_data.reindex(columns=column_names)

In [64]:
# Save to CSV
country_medal_data.to_csv('../csv_data/country_medal_data.csv')

In [65]:
# import dependencies
from sqlalchemy import create_engine
import psycopg2
import pandas as pd
from passwords import password

In [66]:
# noc_regions_data to Postgres
# Create an engine instance
alchemyEngine   = create_engine('postgresql+psycopg2://postgres:' + password + '@cwrubootcamp.c6sjh58vwb2z.us-east-2.rds.amazonaws.com/postgres', pool_recycle=3600)

# Connect to PostgreSQL server
postgreSQLConnection = alchemyEngine.connect()
postgreSQLTable = "noc_regions_data"

try:

    frame = noc_data.to_sql(postgreSQLTable, postgreSQLConnection, if_exists='append')

except ValueError as vx:

    print(vx)

except Exception as ex:  

    print(ex)

else:

    print("PostgreSQL Table %s has been created successfully."%postgreSQLTable)

finally:

    postgreSQLConnection.close()

Table 'country_medal_data' already exists.

In [ ]:
# country_medal_data to Postgres
# Create an engine instance
alchemyEngine   = create_engine('postgresql+psycopg2://postgres:' + password + '@cwrubootcamp.c6sjh58vwb2z.us-east-2.rds.amazonaws.com/postgres', pool_recycle=3600)

# Connect to PostgreSQL server
postgreSQLConnection = alchemyEngine.connect()
postgreSQLTable = "country_medal_data"

try:

    frame = country_medal_data.to_sql(postgreSQLTable, postgreSQLConnection, if_exists='append')

except ValueError as vx:

    print(vx)

except Exception as ex:  

    print(ex)

else:

    print("PostgreSQL Table %s has been created successfully."%postgreSQLTable)

finally:

    postgreSQLConnection.close()

In [ ]:
# city_temperature_data to Postgres
# Create an engine instance
alchemyEngine   = create_engine('postgresql+psycopg2://postgres:' + password + '@cwrubootcamp.c6sjh58vwb2z.us-east-2.rds.amazonaws.com/postgres', pool_recycle=3600)

# Connect to PostgreSQL server
postgreSQLConnection = alchemyEngine.connect()
postgreSQLTable = "city_temperature_data"

try:

    frame = city_temp.to_sql(postgreSQLTable, postgreSQLConnection, if_exists='append')

except ValueError as vx:

    print(vx)

except Exception as ex:  

    print(ex)

else:

    print("PostgreSQL Table %s has been created successfully."%postgreSQLTable)

finally:

    postgreSQLConnection.close()

In [ ]:
# country_temperature_data to Postgres
# Create an engine instance
alchemyEngine   = create_engine('postgresql+psycopg2://postgres:' + password + '@cwrubootcamp.c6sjh58vwb2z.us-east-2.rds.amazonaws.com/postgres', pool_recycle=3600)

# Connect to PostgreSQL server
postgreSQLConnection = alchemyEngine.connect()
postgreSQLTable = "country_temperature_data"

try:

    frame = country_temp_clean.to_sql(postgreSQLTable, postgreSQLConnection, if_exists='append')

except ValueError as vx:

    print(vx)

except Exception as ex:  

    print(ex)

else:

    print("PostgreSQL Table %s has been created successfully."%postgreSQLTable)

finally:

    postgreSQLConnection.close()

In [ ]:
# athlete_medal_data to Postgres
# Create an engine instance
alchemyEngine   = create_engine('postgresql+psycopg2://postgres:' + password + '@cwrubootcamp.c6sjh58vwb2z.us-east-2.rds.amazonaws.com/postgres', pool_recycle=3600)

# Connect to PostgreSQL server
postgreSQLConnection = alchemyEngine.connect()
postgreSQLTable = "athlete_medal_data"

try:

    frame = medal_data.to_sql(postgreSQLTable, postgreSQLConnection, if_exists='append')

except ValueError as vx:

    print(vx)

except Exception as ex:  

    print(ex)

else:

    print("PostgreSQL Table %s has been created successfully."%postgreSQLTable)

finally:

    postgreSQLConnection.close()